Repository: geosimlab/accessibility
Catalog: postgis-intro/sources/locale/*/LC_MESSAGES/welcome.po
Languages: fr, ja, uk

source: Welcome
fr: Bienvenue
ja: ようこそ
uk: Ласкаво просимо

source: Workshop Conventions
fr: Convention de l'atelier
ja: ワークショップの取り決め
uk: Правила проведення семінару

source: These sections conform to a number of conventions to make it easier to follow the conversation. This section gives a brief overview of what to expect in the way of typographic conventions, as well as a short overview of the structure of each workbook.
fr: Ces sections respectent un certain nombre de conventions pour rendre la conversation plus facile à suivre. Cette section offre une brève vue d'ensemble sur ce à quoi s'attendre en ce qui concerne les conventions typographiques ainsi qu'une courte vue d'ensemble concernant la structure de chaque livre d'exercice.
ja: この文書では、会話を分かりやすくするために、いくつかの取り決めに従います。このセクションでは、文字体裁の規則で予想されるべきことの概要を、ワークブックごとの構造の概要とともに提示します。
uk: Ці розділи відповідають низці угод, щоб полегшити сприйняття матеріалу. У цьому розділі подано короткий огляд типографічних правил, а також короткий огляд структури кожного робочого блоку.

source: Directions
ja: 指示
uk: Вказівки

source: Directions for you, the workshop attendee, will be noted by **bold** font.
fr: Les instructions qui vous sont destinées, en tant que participant à l'atelier, seront indiquées en caractères **gras**.
ja: ワークショップ参加者であるみなさんへの指示は**太字**フォントで強調表示します。
uk: Вказівки для вас, учасника воркшопу, будуть виділені **жирним** шрифтом .

source: For example:
fr: Par exemple:
ja: 例:
uk: Наприклад:

source: Click **Next** to continue.
fr: Cliquer sur **Next** pour continuer.
ja: **次へ**をクリックすると続行します。
uk: Натисніть **Далі**, щоб продовжити.

source: Code
ja: コード
uk: Код

source: SQL query examples will be displayed in an offset box
fr: Les exemples de requêtes SQL seront affichées dans une case
ja: SQLクエリの例はボックスに表示します
uk: Приклади SQL-запитів будуть відображатися у блоці зі зміщенням

source: These examples can be entered into the query window or command line interface.
fr: Ces exemple peuvent être rentrées dans une fenêtre de requête ou dans une interface en ligne de commande.
ja: これらの例は、クエリウィンドウやコマンドラインインタフェースに入れることができます。
uk: Ці приклади можна ввести у вікно запиту або інтерфейс командного рядка.

source: Notes
ja: ご注意
uk: Нотатки

source: Notes are used to provide information that is useful but not critical to the overall understanding of the topic.
fr: Les notes sont utilisées pour fournir des informations utiles mais non indispensables à la compréhension globale du thème.
ja: 「ご注意」は、便利だけどトピック全体の理解にとっては重要でない情報を提供しています。
uk: Примітки використовуються для надання інформації, яка є корисною, але не є критично важливою для загального розуміння теми.

source: If you haven't eaten an apple today, the doctor may be on the way.
ja: 腹八分目を超えると医者が来るかも知れません。
uk: Якщо не з'їв ти фрукти зранку, твій доктор буде біля ґанку.

source: Functions
fr: Fonctions
ja: 関数
uk: Функції

source: Where function names are defined in the text, they will be rendered in a :command:`bold` font.
fr: Quand des noms de fonctions sont définies dans le texte, elles seront affichées avec une police d'écriture :command:`grasse`.
ja: 関数名がテキストで定義されている場合、:command:`太字` フォントで示されます。
uk: Якщо імена функцій визначено у тексті, їх буде виділено :command:`жирним` шрифтом.

source: :command:`ST_Touches(geometry A, geometry B)` returns TRUE if either of the geometries' boundaries intersect
fr: :command:`ST_Touches(geometry A, geometry B)`renvoie TRUE si les limites de deux formes géométrique s'intersectent.
ja: :command:`ST_Touches(geometry A, geometry B)` は、ジオメトリの境界のいずれかがインタセクトするなら TRUE を返します
uk: :command:`ST_Touches(геометрія A, геометрія B)` повертає TRUE, якщо будь-яка з границь геометрій перетинається

source: Files, Tables and Column Names
fr: Nons de fichiers, de tables et de colonnes
ja: ファイル名、テーブル名、カラム名
uk: Файли, таблиці та назви стовпців

source: File names, paths, table names and column names will be shown in ``fixed-width`` font.
fr: Les noms de fichiers, de chemins, de tables et de colonnes seront affichées dans une police d'écriture à ``largeur fixe``.
ja: ファイル名、パス、テーブル名、カラム名は「固定幅」フォントで示します。
uk: Назви файлів, шляхи, назви таблиць та стовпців буде показано шрифтом ``фіксованої ширини``.

source: Select the ``name`` column in the ``nyc_streets`` table.
fr: Sélétionne la colonne ``name`` dans la table ``nyc_streets``.
ja: ``nyc_streets`` テーブルの ``name``カラムを選択します。
uk: Виберіть стовпець ``name`` у таблиці ``nyc_streets``.

source: Menus and Form elements
fr: Menus et formulaires
ja: メニューとフォーム要素
uk: Меню та елементи форм

source: Menus/submenus and form elements such as fields or check boxes and other on-screen artifacts are displayed in *italics*.
fr: Les menus, sous-menus et les formulaires comme les champs de données ou les cases à cocher et les autres artefacts visuels seront affichés en *italique*.
ja: メニュー/サブメニューや、フィールドやチェックボックス等のフォーム要素といった、画面上に表示されるものは、*斜体*で示します。
uk: Меню/підменю та елементи форм, такі як поля, прапорці та інші екранні артефакти, відображаються курсивним шрифтом.

source: Click on the *File > New* menu. Check the box that says *Confirm*.
fr: Cliquer sur le menu *Fichier > Nouveau*. Cocher la case *Confirmer*.
ja: *ファイル > 新規* メニューをクリックします。*確認* というボックスをクリックします。
uk: Натисніть на меню *Файл > Створити*. Встановіть прапорець з написом *Підтвердити*.

source: Workflow
fr: Déroulement du travail
ja: 演習の流れ
uk: Робочий процес

source: Sections are designed to be progressive. Each section will start with the assumption that you have completed and understood the previous section in the series and will build on that knowledge. A single section will progress through a handful of ideas and provide working examples wherever possible. At the end of a section, where appropriate, we have included a handful of exercises to allow you to try out the ideas we've presented. In some cases the section will include "Things To Try". These tasks contain more complex problems than the exercises and is designed to challenge participants with advanced knowledge.
fr: Les sections sont faites pour être progressives. Chaque section commencera avec la supposition que vous avec terminé et compris la section précédente. Une unique section se basera sur quelques concepts et des exemples seront fournis chaque fois que cela est possible. À la fin d'une section, quand cela est approprié, nous avons inclus une poignée d'exercices pour vous permettre de tester les idées que nous avons présentées. Dans certains cas, la section inclura "À tester". Ces tâches contiennent des problèmes plus complexes que les exercices et sont faits pour vous mettre au défi avec des connaissances avancées.
ja: この文書の各セクションは、漸進するように設計しています。各セクションは前のセクションを完了していて、内容を理解していて、その知識をもとに構築することを前提としています。個々のセクションでは少量のアイデアを通して進み、可能な限り作業例を示します。セクションの終わり付近の適切なところで、提示したアイデアを試すことができるように、いくつかの演習を示します。セクションによっては「試すべきこと」を含んでいる場合があります。このタスクは、演習より複雑な問題を含んでいて、参加者が高度な知識をもって挑戦するために設計されています。
uk: Розділи розроблені таким чином, щоб бути послідовними. Кожен розділ починається з припущення, що ви прочитали і зрозуміли попередній розділ серії, і буде спиратися на ці знання. В одному розділі буде розглянуто кілька ідей і, де це можливо, наведено робочі приклади. Наприкінці розділу, де це доречно, ми включили кілька вправ, щоб ви могли випробувати представлені ідеї на практиці. У деяких випадках розділ міститиме "Завдання для самостійного виконання". Ці завдання містять більш складні проблеми, ніж вправи, і призначені для учасників з більш високим рівнем знань.
